; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=53, out_folder=htg/blocksworld/training, instance_id=33, seed=2057, goal_proportion=0.1

(define (problem blocksworld-33)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 - object)
 (:init 
    (arm-empty)
    (clear b31)
    (on b31 b8)
    (on b8 b34)
    (on b34 b29)
    (on-table b29)
    (clear b13)
    (on b13 b3)
    (on b3 b28)
    (on b28 b44)
    (on b44 b38)
    (on-table b38)
    (clear b43)
    (on b43 b52)
    (on b52 b47)
    (on-table b47)
    (clear b9)
    (on b9 b6)
    (on b6 b11)
    (on b11 b45)
    (on b45 b15)
    (on b15 b33)
    (on b33 b19)
    (on b19 b5)
    (on b5 b14)
    (on-table b14)
    (clear b32)
    (on b32 b22)
    (on b22 b1)
    (on b1 b25)
    (on b25 b48)
    (on b48 b36)
    (on b36 b42)
    (on b42 b40)
    (on b40 b23)
    (on-table b23)
    (clear b27)
    (on b27 b51)
    (on-table b51)
    (clear b12)
    (on b12 b24)
    (on b24 b16)
    (on b16 b20)
    (on b20 b50)
    (on b50 b21)
    (on b21 b17)
    (on b17 b2)
    (on b2 b53)
    (on b53 b26)
    (on b26 b37)
    (on b37 b7)
    (on-table b7)
    (clear b35)
    (on-table b35)
    (clear b10)
    (on-table b10)
    (clear b41)
    (on b41 b4)
    (on-table b4)
    (clear b39)
    (on b39 b49)
    (on b49 b18)
    (on b18 b30)
    (on b30 b46)
    (on-table b46))
 (:goal  (and 
    (clear b4)
    (on b4 b1)
    (on b1 b2)
    (on b2 b3)
    (on-table b3)
    (clear b5)
    (on-table b5))))

; plan
1. (unstack b41 b4)
   deleted: (on b41 b4) (clear b41) (arm-empty)
   added: (holding b41) (clear b4)
   goals met: 1 of 7
2. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 1 of 7
3. (unstack b13 b3)
   deleted: (on b13 b3) (clear b13) (arm-empty)
   added: (holding b13) (clear b3)
   goals met: 1 of 7
4. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 7
5. (unstack b3 b28)
   deleted: (on b3 b28) (clear b3) (arm-empty)
   added: (holding b3) (clear b28)
   goals met: 1 of 7
6. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 7
7. (unstack b32 b22)
   deleted: (on b32 b22) (clear b32) (arm-empty)
   added: (holding b32) (clear b22)
   goals met: 2 of 7
8. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 2 of 7
9. (unstack b22 b1)
   deleted: (on b22 b1) (clear b22) (arm-empty)
   added: (holding b22) (clear b1)
   goals met: 2 of 7
10. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 2 of 7
11. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 1 of 7
12. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 3 of 7
13. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 3 of 7
14. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 7
15. (unstack b6 b11)
   deleted: (on b6 b11) (clear b6) (arm-empty)
   added: (holding b6) (clear b11)
   goals met: 3 of 7
16. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 7
17. (unstack b11 b45)
   deleted: (on b11 b45) (clear b11) (arm-empty)
   added: (holding b11) (clear b45)
   goals met: 3 of 7
18. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 3 of 7
19. (unstack b45 b15)
   deleted: (on b45 b15) (clear b45) (arm-empty)
   added: (holding b45) (clear b15)
   goals met: 3 of 7
20. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 3 of 7
21. (unstack b15 b33)
   deleted: (on b15 b33) (clear b15) (arm-empty)
   added: (holding b15) (clear b33)
   goals met: 3 of 7
22. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 3 of 7
23. (unstack b33 b19)
   deleted: (on b33 b19) (clear b33) (arm-empty)
   added: (holding b33) (clear b19)
   goals met: 3 of 7
24. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 3 of 7
25. (unstack b19 b5)
   deleted: (on b19 b5) (clear b19) (arm-empty)
   added: (holding b19) (clear b5)
   goals met: 4 of 7
26. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 4 of 7
27. (unstack b5 b14)
   deleted: (on b5 b14) (clear b5) (arm-empty)
   added: (holding b5) (clear b14)
   goals met: 3 of 7
28. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 7
29. (unstack b12 b24)
   deleted: (on b12 b24) (clear b12) (arm-empty)
   added: (holding b12) (clear b24)
   goals met: 5 of 7
30. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 5 of 7
31. (unstack b24 b16)
   deleted: (on b24 b16) (clear b24) (arm-empty)
   added: (holding b24) (clear b16)
   goals met: 5 of 7
32. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 5 of 7
33. (unstack b16 b20)
   deleted: (on b16 b20) (clear b16) (arm-empty)
   added: (holding b16) (clear b20)
   goals met: 5 of 7
34. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 5 of 7
35. (unstack b20 b50)
   deleted: (on b20 b50) (clear b20) (arm-empty)
   added: (holding b20) (clear b50)
   goals met: 5 of 7
36. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 5 of 7
37. (unstack b50 b21)
   deleted: (on b50 b21) (clear b50) (arm-empty)
   added: (holding b50) (clear b21)
   goals met: 5 of 7
38. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 5 of 7
39. (unstack b21 b17)
   deleted: (on b21 b17) (clear b21) (arm-empty)
   added: (holding b21) (clear b17)
   goals met: 5 of 7
40. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 5 of 7
41. (unstack b17 b2)
   deleted: (on b17 b2) (clear b17) (arm-empty)
   added: (holding b17) (clear b2)
   goals met: 5 of 7
42. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 5 of 7
43. (unstack b2 b53)
   deleted: (on b2 b53) (clear b2) (arm-empty)
   added: (holding b2) (clear b53)
   goals met: 5 of 7
44. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 6 of 7
45. (unstack b4 b1)
   deleted: (on b4 b1) (clear b4) (arm-empty)
   added: (holding b4) (clear b1)
   goals met: 4 of 7
46. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 7
47. (unstack b1 b25)
   deleted: (on b1 b25) (clear b1) (arm-empty)
   added: (holding b1) (clear b25)
   goals met: 5 of 7
48. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 6 of 7
49. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 7
50. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 7 of 7
